{"format": "graph-model", "generatedBy": "2.15.1", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "8"}]}}}, "outputs": {"boost_times_lin": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "420"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/mpk_nonlin/boost_unnormalize_pow10/Pow/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_34", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_33", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_3/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_26", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_25", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_2/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_1/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_0/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/mpk_nonlin/boost_normalization/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_dense_0/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_dense_0/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_dense_3/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_dense_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_output_dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "420"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_output_dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "420"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_unnormalize_pow10/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "420"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_unnormalize_pow10/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "420"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_unnormalize_pow10/Pow/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_32", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_31", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_3/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_24", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_23", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_2/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_16", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_1/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_0/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/slice_lin_input/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/slice_lin_input/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/slice_lin_input/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/slice_lin_input/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/slice_lin_input/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/slice_lin_input/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/slice_lin_input/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/mpk_nonlin/lin2_normalization/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_dense_0/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_dense_0/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_dense_3/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_dense_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_output_dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "420"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_output_dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "420"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_unnormalize_pow10/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "420"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_unnormalize_pow10/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "420"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "8"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_normalization/sub", "op": "Sub", "input": ["input_1", "unknown_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/slice_lin_input/strided_slice", "op": "StridedSlice", "input": ["input_1", "StatefulPartitionedCall/mpk_nonlin/slice_lin_input/strided_slice/stack", "StatefulPartitionedCall/mpk_nonlin/slice_lin_input/strided_slice/stack_1", "StatefulPartitionedCall/mpk_nonlin/slice_lin_input/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/slice_lin_input/strided_slice_1", "op": "StridedSlice", "input": ["input_1", "StatefulPartitionedCall/mpk_nonlin/slice_lin_input/strided_slice_1/stack", "StatefulPartitionedCall/mpk_nonlin/slice_lin_input/strided_slice_1/stack_1", "StatefulPartitionedCall/mpk_nonlin/slice_lin_input/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_normalization/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_nonlin/boost_normalization/sub", "ConstantFolding/StatefulPartitionedCall/mpk_nonlin/boost_normalization/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/slice_lin_input/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/mpk_nonlin/slice_lin_input/strided_slice", "StatefulPartitionedCall/mpk_nonlin/slice_lin_input/strided_slice_1", "StatefulPartitionedCall/mpk_nonlin/slice_lin_input/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_dense_0/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/mpk_nonlin/boost_normalization/truediv", "StatefulPartitionedCall/mpk_nonlin/boost_dense_0/MatMul/ReadVariableOp", "StatefulPartitionedCall/mpk_nonlin/boost_dense_0/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_normalization/sub", "op": "Sub", "input": ["StatefulPartitionedCall/mpk_nonlin/slice_lin_input/concat", "unknown"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_0/mul", "op": "Mul", "input": ["unknown_9", "StatefulPartitionedCall/mpk_nonlin/boost_dense_0/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_normalization/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_nonlin/lin2_normalization/sub", "ConstantFolding/StatefulPartitionedCall/mpk_nonlin/lin2_normalization/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_0/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/mpk_nonlin/boost_activation_0/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_dense_0/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/mpk_nonlin/lin2_normalization/truediv", "StatefulPartitionedCall/mpk_nonlin/lin2_dense_0/MatMul/ReadVariableOp", "StatefulPartitionedCall/mpk_nonlin/lin2_dense_0/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_0/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_nonlin/boost_activation_0/Sigmoid", "StatefulPartitionedCall/mpk_nonlin/boost_activation_0/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_0/mul", "op": "Mul", "input": ["unknown_7", "StatefulPartitionedCall/mpk_nonlin/lin2_dense_0/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_0/add", "op": "AddV2", "input": ["unknown_10", "StatefulPartitionedCall/mpk_nonlin/boost_activation_0/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_0/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/mpk_nonlin/lin2_activation_0/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_0/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_nonlin/boost_activation_0/add", "StatefulPartitionedCall/mpk_nonlin/boost_dense_0/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_0/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_nonlin/lin2_activation_0/Sigmoid", "StatefulPartitionedCall/mpk_nonlin/lin2_activation_0/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/mpk_nonlin/boost_activation_0/mul_2", "StatefulPartitionedCall/mpk_nonlin/boost_dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/mpk_nonlin/boost_dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_0/add", "op": "AddV2", "input": ["unknown_8", "StatefulPartitionedCall/mpk_nonlin/lin2_activation_0/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_1/mul", "op": "Mul", "input": ["unknown_17", "StatefulPartitionedCall/mpk_nonlin/boost_dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_0/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_nonlin/lin2_activation_0/add", "StatefulPartitionedCall/mpk_nonlin/lin2_dense_0/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/mpk_nonlin/boost_activation_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/mpk_nonlin/lin2_activation_0/mul_2", "StatefulPartitionedCall/mpk_nonlin/lin2_dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/mpk_nonlin/lin2_dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_nonlin/boost_activation_1/Sigmoid", "StatefulPartitionedCall/mpk_nonlin/boost_activation_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_1/mul", "op": "Mul", "input": ["unknown_15", "StatefulPartitionedCall/mpk_nonlin/lin2_dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_1/add", "op": "AddV2", "input": ["unknown_18", "StatefulPartitionedCall/mpk_nonlin/boost_activation_1/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/mpk_nonlin/lin2_activation_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_1/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_nonlin/boost_activation_1/add", "StatefulPartitionedCall/mpk_nonlin/boost_dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_nonlin/lin2_activation_1/Sigmoid", "StatefulPartitionedCall/mpk_nonlin/lin2_activation_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/mpk_nonlin/boost_activation_1/mul_2", "StatefulPartitionedCall/mpk_nonlin/boost_dense_2/MatMul/ReadVariableOp", "StatefulPartitionedCall/mpk_nonlin/boost_dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_1/add", "op": "AddV2", "input": ["unknown_16", "StatefulPartitionedCall/mpk_nonlin/lin2_activation_1/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_2/mul", "op": "Mul", "input": ["unknown_25", "StatefulPartitionedCall/mpk_nonlin/boost_dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_1/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_nonlin/lin2_activation_1/add", "StatefulPartitionedCall/mpk_nonlin/lin2_dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_2/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/mpk_nonlin/boost_activation_2/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/mpk_nonlin/lin2_activation_1/mul_2", "StatefulPartitionedCall/mpk_nonlin/lin2_dense_2/MatMul/ReadVariableOp", "StatefulPartitionedCall/mpk_nonlin/lin2_dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_2/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_nonlin/boost_activation_2/Sigmoid", "StatefulPartitionedCall/mpk_nonlin/boost_activation_2/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_2/mul", "op": "Mul", "input": ["unknown_23", "StatefulPartitionedCall/mpk_nonlin/lin2_dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_2/add", "op": "AddV2", "input": ["unknown_26", "StatefulPartitionedCall/mpk_nonlin/boost_activation_2/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_2/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/mpk_nonlin/lin2_activation_2/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_2/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_nonlin/boost_activation_2/add", "StatefulPartitionedCall/mpk_nonlin/boost_dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_2/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_nonlin/lin2_activation_2/Sigmoid", "StatefulPartitionedCall/mpk_nonlin/lin2_activation_2/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_dense_3/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/mpk_nonlin/boost_activation_2/mul_2", "StatefulPartitionedCall/mpk_nonlin/boost_dense_3/MatMul/ReadVariableOp", "StatefulPartitionedCall/mpk_nonlin/boost_dense_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_2/add", "op": "AddV2", "input": ["unknown_24", "StatefulPartitionedCall/mpk_nonlin/lin2_activation_2/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_3/mul", "op": "Mul", "input": ["unknown_33", "StatefulPartitionedCall/mpk_nonlin/boost_dense_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_2/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_nonlin/lin2_activation_2/add", "StatefulPartitionedCall/mpk_nonlin/lin2_dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_3/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/mpk_nonlin/boost_activation_3/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_dense_3/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/mpk_nonlin/lin2_activation_2/mul_2", "StatefulPartitionedCall/mpk_nonlin/lin2_dense_3/MatMul/ReadVariableOp", "StatefulPartitionedCall/mpk_nonlin/lin2_dense_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_3/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_nonlin/boost_activation_3/Sigmoid", "StatefulPartitionedCall/mpk_nonlin/boost_activation_3/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_3/mul", "op": "Mul", "input": ["unknown_31", "StatefulPartitionedCall/mpk_nonlin/lin2_dense_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_3/add", "op": "AddV2", "input": ["unknown_34", "StatefulPartitionedCall/mpk_nonlin/boost_activation_3/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_3/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/mpk_nonlin/lin2_activation_3/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_3/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_nonlin/boost_activation_3/add", "StatefulPartitionedCall/mpk_nonlin/boost_dense_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_3/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_nonlin/lin2_activation_3/Sigmoid", "StatefulPartitionedCall/mpk_nonlin/lin2_activation_3/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_output_dense/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/mpk_nonlin/boost_activation_3/mul_2", "StatefulPartitionedCall/mpk_nonlin/boost_output_dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/mpk_nonlin/boost_output_dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_3/add", "op": "AddV2", "input": ["unknown_32", "StatefulPartitionedCall/mpk_nonlin/lin2_activation_3/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_unnormalize_pow10/mul", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_nonlin/boost_output_dense/BiasAdd", "StatefulPartitionedCall/mpk_nonlin/boost_unnormalize_pow10/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_3/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_nonlin/lin2_activation_3/add", "StatefulPartitionedCall/mpk_nonlin/lin2_dense_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_unnormalize_pow10/add", "op": "AddV2", "input": ["StatefulPartitionedCall/mpk_nonlin/boost_unnormalize_pow10/mul", "StatefulPartitionedCall/mpk_nonlin/boost_unnormalize_pow10/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_output_dense/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/mpk_nonlin/lin2_activation_3/mul_2", "StatefulPartitionedCall/mpk_nonlin/lin2_output_dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/mpk_nonlin/lin2_output_dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_unnormalize_pow10/Pow", "op": "Pow", "input": ["StatefulPartitionedCall/mpk_nonlin/boost_unnormalize_pow10/Pow/x", "StatefulPartitionedCall/mpk_nonlin/boost_unnormalize_pow10/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_unnormalize_pow10/mul", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_nonlin/lin2_output_dense/BiasAdd", "StatefulPartitionedCall/mpk_nonlin/lin2_unnormalize_pow10/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_unnormalize_pow10/add", "op": "AddV2", "input": ["StatefulPartitionedCall/mpk_nonlin/lin2_unnormalize_pow10/mul", "StatefulPartitionedCall/mpk_nonlin/lin2_unnormalize_pow10/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_unnormalize_pow10/Pow", "op": "Pow", "input": ["StatefulPartitionedCall/mpk_nonlin/lin2_unnormalize_pow10/Pow/x", "StatefulPartitionedCall/mpk_nonlin/lin2_unnormalize_pow10/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_times_lin/mul", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_nonlin/boost_unnormalize_pow10/Pow", "StatefulPartitionedCall/mpk_nonlin/lin2_unnormalize_pow10/Pow"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/mpk_nonlin/boost_times_lin/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/mpk_nonlin/boost_unnormalize_pow10/Pow/x", "shape": [], "dtype": "float32"}, {"name": "unknown_34", "shape": [512], "dtype": "float32"}, {"name": "unknown_33", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_3/sub", "shape": [512], "dtype": "float32"}, {"name": "unknown_26", "shape": [512], "dtype": "float32"}, {"name": "unknown_25", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_2/sub", "shape": [512], "dtype": "float32"}, {"name": "unknown_18", "shape": [512], "dtype": "float32"}, {"name": "unknown_17", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_1/sub", "shape": [512], "dtype": "float32"}, {"name": "unknown_10", "shape": [512], "dtype": "float32"}, {"name": "unknown_9", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_activation_0/sub", "shape": [512], "dtype": "float32"}, {"name": "unknown_1", "shape": [1, 8], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/mpk_nonlin/boost_normalization/truediv_recip", "shape": [1, 8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_dense_0/MatMul/ReadVariableOp", "shape": [8, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_dense_0/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_dense_1/MatMul/ReadVariableOp", "shape": [512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_dense_1/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_dense_2/MatMul/ReadVariableOp", "shape": [512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_dense_2/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_dense_3/MatMul/ReadVariableOp", "shape": [512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_dense_3/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_output_dense/MatMul/ReadVariableOp", "shape": [512, 420], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_output_dense/BiasAdd/ReadVariableOp", "shape": [420], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_unnormalize_pow10/mul/y", "shape": [420], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/boost_unnormalize_pow10/add/y", "shape": [420], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_unnormalize_pow10/Pow/x", "shape": [], "dtype": "float32"}, {"name": "unknown_32", "shape": [512], "dtype": "float32"}, {"name": "unknown_31", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_3/sub", "shape": [512], "dtype": "float32"}, {"name": "unknown_24", "shape": [512], "dtype": "float32"}, {"name": "unknown_23", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_2/sub", "shape": [512], "dtype": "float32"}, {"name": "unknown_16", "shape": [512], "dtype": "float32"}, {"name": "unknown_15", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_1/sub", "shape": [512], "dtype": "float32"}, {"name": "unknown_8", "shape": [512], "dtype": "float32"}, {"name": "unknown_7", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_activation_0/sub", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/slice_lin_input/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/slice_lin_input/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/slice_lin_input/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/slice_lin_input/strided_slice_1/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/slice_lin_input/strided_slice_1/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/slice_lin_input/strided_slice_1/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/slice_lin_input/concat/axis", "shape": [], "dtype": "int32"}, {"name": "unknown", "shape": [1, 6], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/mpk_nonlin/lin2_normalization/truediv_recip", "shape": [1, 6], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_dense_0/MatMul/ReadVariableOp", "shape": [6, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_dense_0/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_dense_1/MatMul/ReadVariableOp", "shape": [512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_dense_1/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_dense_2/MatMul/ReadVariableOp", "shape": [512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_dense_2/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_dense_3/MatMul/ReadVariableOp", "shape": [512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_dense_3/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_output_dense/MatMul/ReadVariableOp", "shape": [512, 420], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_output_dense/BiasAdd/ReadVariableOp", "shape": [420], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_unnormalize_pow10/mul/y", "shape": [420], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_nonlin/lin2_unnormalize_pow10/add/y", "shape": [420], "dtype": "float32"}]}]}