{"format": "graph-model", "generatedBy": "2.15.1", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6"}]}}}, "outputs": {"lin_unnormalize_pow10": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "420"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/mpk_lin/lin_unnormalize_pow10/Pow/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_16", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_3/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_2/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_1/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_0/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/mpk_lin/lin_normalization/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_dense_0/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_dense_0/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_dense_3/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_dense_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_output_dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "420"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_output_dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "420"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_unnormalize_pow10/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "420"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_unnormalize_pow10/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "420"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "6"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_normalization/sub", "op": "Sub", "input": ["input_1", "unknown"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_normalization/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_lin/lin_normalization/sub", "ConstantFolding/StatefulPartitionedCall/mpk_lin/lin_normalization/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_dense_0/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/mpk_lin/lin_normalization/truediv", "StatefulPartitionedCall/mpk_lin/lin_dense_0/MatMul/ReadVariableOp", "StatefulPartitionedCall/mpk_lin/lin_dense_0/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_0/mul", "op": "Mul", "input": ["unknown_3", "StatefulPartitionedCall/mpk_lin/lin_dense_0/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_0/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/mpk_lin/lin_activation_0/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_0/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_lin/lin_activation_0/Sigmoid", "StatefulPartitionedCall/mpk_lin/lin_activation_0/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_0/add", "op": "AddV2", "input": ["unknown_4", "StatefulPartitionedCall/mpk_lin/lin_activation_0/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_0/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_lin/lin_activation_0/add", "StatefulPartitionedCall/mpk_lin/lin_dense_0/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/mpk_lin/lin_activation_0/mul_2", "StatefulPartitionedCall/mpk_lin/lin_dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/mpk_lin/lin_dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_1/mul", "op": "Mul", "input": ["unknown_7", "StatefulPartitionedCall/mpk_lin/lin_dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/mpk_lin/lin_activation_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_lin/lin_activation_1/Sigmoid", "StatefulPartitionedCall/mpk_lin/lin_activation_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_1/add", "op": "AddV2", "input": ["unknown_8", "StatefulPartitionedCall/mpk_lin/lin_activation_1/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_1/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_lin/lin_activation_1/add", "StatefulPartitionedCall/mpk_lin/lin_dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/mpk_lin/lin_activation_1/mul_2", "StatefulPartitionedCall/mpk_lin/lin_dense_2/MatMul/ReadVariableOp", "StatefulPartitionedCall/mpk_lin/lin_dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_2/mul", "op": "Mul", "input": ["unknown_11", "StatefulPartitionedCall/mpk_lin/lin_dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_2/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/mpk_lin/lin_activation_2/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_2/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_lin/lin_activation_2/Sigmoid", "StatefulPartitionedCall/mpk_lin/lin_activation_2/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_2/add", "op": "AddV2", "input": ["unknown_12", "StatefulPartitionedCall/mpk_lin/lin_activation_2/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_2/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_lin/lin_activation_2/add", "StatefulPartitionedCall/mpk_lin/lin_dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_dense_3/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/mpk_lin/lin_activation_2/mul_2", "StatefulPartitionedCall/mpk_lin/lin_dense_3/MatMul/ReadVariableOp", "StatefulPartitionedCall/mpk_lin/lin_dense_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_3/mul", "op": "Mul", "input": ["unknown_15", "StatefulPartitionedCall/mpk_lin/lin_dense_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_3/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/mpk_lin/lin_activation_3/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_3/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_lin/lin_activation_3/Sigmoid", "StatefulPartitionedCall/mpk_lin/lin_activation_3/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_3/add", "op": "AddV2", "input": ["unknown_16", "StatefulPartitionedCall/mpk_lin/lin_activation_3/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_3/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_lin/lin_activation_3/add", "StatefulPartitionedCall/mpk_lin/lin_dense_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_output_dense/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/mpk_lin/lin_activation_3/mul_2", "StatefulPartitionedCall/mpk_lin/lin_output_dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/mpk_lin/lin_output_dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_unnormalize_pow10/mul", "op": "Mul", "input": ["StatefulPartitionedCall/mpk_lin/lin_output_dense/BiasAdd", "StatefulPartitionedCall/mpk_lin/lin_unnormalize_pow10/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_unnormalize_pow10/add", "op": "AddV2", "input": ["StatefulPartitionedCall/mpk_lin/lin_unnormalize_pow10/mul", "StatefulPartitionedCall/mpk_lin/lin_unnormalize_pow10/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mpk_lin/lin_unnormalize_pow10/Pow", "op": "Pow", "input": ["StatefulPartitionedCall/mpk_lin/lin_unnormalize_pow10/Pow/x", "StatefulPartitionedCall/mpk_lin/lin_unnormalize_pow10/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/mpk_lin/lin_unnormalize_pow10/Pow"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/mpk_lin/lin_unnormalize_pow10/Pow/x", "shape": [], "dtype": "float32"}, {"name": "unknown_16", "shape": [512], "dtype": "float32"}, {"name": "unknown_15", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_3/sub", "shape": [512], "dtype": "float32"}, {"name": "unknown_12", "shape": [512], "dtype": "float32"}, {"name": "unknown_11", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_2/sub", "shape": [512], "dtype": "float32"}, {"name": "unknown_8", "shape": [512], "dtype": "float32"}, {"name": "unknown_7", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_1/sub", "shape": [512], "dtype": "float32"}, {"name": "unknown_4", "shape": [512], "dtype": "float32"}, {"name": "unknown_3", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_lin/lin_activation_0/sub", "shape": [512], "dtype": "float32"}, {"name": "unknown", "shape": [1, 6], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/mpk_lin/lin_normalization/truediv_recip", "shape": [1, 6], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_lin/lin_dense_0/MatMul/ReadVariableOp", "shape": [6, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_lin/lin_dense_0/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_lin/lin_dense_1/MatMul/ReadVariableOp", "shape": [512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_lin/lin_dense_1/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_lin/lin_dense_2/MatMul/ReadVariableOp", "shape": [512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_lin/lin_dense_2/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_lin/lin_dense_3/MatMul/ReadVariableOp", "shape": [512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_lin/lin_dense_3/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_lin/lin_output_dense/MatMul/ReadVariableOp", "shape": [512, 420], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_lin/lin_output_dense/BiasAdd/ReadVariableOp", "shape": [420], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_lin/lin_unnormalize_pow10/mul/y", "shape": [420], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mpk_lin/lin_unnormalize_pow10/add/y", "shape": [420], "dtype": "float32"}]}]}